#!/usr/bin/env bash

# config 파일을 읽어 로컬에 데이터베이스를 생성한다.
./node_modules/.bin/sequelize db:create

echo "################################################
🛡️ 데이터베이스 생성 완료 🛡️ 
################################################"

./node_modules/.bin/sequelize db:migrate

echo "################################################
🛡️ SUCCESS DATABASE MIGRATE 🛡️ 
################################################"

./node_modules/.bin/sequelize db:seed:all

echo "################################################
🛡️ 테스트 데이터 생성 🛡️ 
################################################"